<template>
  <div>
    <h2>0x0</h2>
    <p>Exercise Of BlockChain 是一个零成本体验 DeFi 的平台。</p>
    <h2>0x1</h2>
    <p>
      本篇简短文字尽可能为你提供务实且详细的关于 DeFi
      的内容，尽量通俗易懂，尽量言之有物！
    </p>
    <h2>0x2</h2>
    <p>
      DeFi (Decentralized Finance)
      去中心化金融，是基于区块链的一大创新。其中最具有代表性的则是
      UniSwap，其所代表的 AMM 机制可谓是掀起了 DeFi 的浪潮。
    </p>
    <p>
      所谓 AMM 即 Automatic Market Maker，不同于传统交易所的做市商机制。AMM
      使用一种恒定乘积公式（ X * Y = K
      ）来决定每一种代币（可以理解为股票）的价格。X 为其中一个代币的数量，Y
      为另一种代币的数量，因此当 K
      不变时，一种代币数量的减少必定会导致另一种代币数量的增多，根据物以稀为贵，便可以决定出每一种代币的价格了。
    </p>
    <h2>0x3</h2>
    <p>
      举例来说，我们创建了一个池子（池子就理解为用来盛放代币的容器），并在池子里面添加了
      10个ETH（以太坊）和 1000个CT （Chuck
      Token）两种代币。那么经过简单的计算我们可以得出，为了维持 X * Y = K 的 K
      不变，我们兑换 1 个 ETH 大约需要 111 个 CT（9 * 1111 = 10000）。这便是 AMM
      的工作机制。可以在这里进行实验。
    </p>
    <h2>0x4</h2>
    <p></p>
  </div>
</template>
